cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'puma/puma'
tap 'caskroom/cask'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Python
brew 'python'
brew 'python3'
brew 'pyenv'

brew 'ack'
brew 'ansible'
brew 'ansible-lint'
brew 'ask-cli'
brew 'awscli'
brew 'coreutils'
brew 'curl'
brew 'git'
brew 'grc'
brew 'hub'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'tree'
brew 'unrar'
brew 'wget'

cask 'alfred'
cask 'cheatsheet'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'pgadmin4'
cask 'slack'
cask 'sublime-text'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

cask 'steam'
