cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Python
brew 'python'
brew 'pyenv'

brew 'ack'
brew 'awscli'
brew 'coreutils'
brew 'curl'
brew 'git'
brew 'go'
brew 'grc'
brew 'hub'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'netcat'
brew 'node'
brew 'nvm'
brew 'openssl'
brew 'saml2aws'
brew 'tree'
brew 'wget'

cask '1password'
cask 'alfred'
cask 'anylist' 
cask 'audacity'
cask 'authy'
cask 'cheatsheet'
cask 'divvy'
cask 'drawio'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keyboard-maestro'
# cask 'logitech-options'
cask 'notion'
cask 'postman'
cask 'rocket'
cask 'slack'
cask 'spotify'
cask 'todoist'
cask 'visual-studio-code'
