cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'puma/puma'
tap 'caskroom/cask'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Python
brew 'python'
brew 'pyenv'

brew 'ack'
# brew 'ask-cli'
brew 'awscli'
brew 'coreutils'
brew 'curl'
brew 'git'
brew 'grc'
brew 'hub'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'netcat'
brew 'node'
brew 'openssl'
brew 'tree'
brew 'unrar'
brew 'wget'

cask 'alfred'
cask 'anylist'
cask 'cheatsheet'
cask 'clipy'
cask 'discord'
cask 'divvy'
cask 'docker'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'font-hack-nerd-font'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keyboard-maestro'
cask 'logitech-options'
cask 'nosql-workbench-for-amazon-dynamodb'
cask 'notion'
cask 'postman'
cask 'rocket'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
